<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;
use App\Models\Project;



class CreateProjectSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $Project = [

            //ชีววิทยา
            [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตร์มหาบัณฑิต สาขาวิชาชีววิทยาสำหรับครู',
               'subPlanId'=>'8',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการพัฒนาทัศนียภาพและกีฬาสามัคคีน้องพี่ชีววิทยา',
               'subPlanId'=>'12',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการชิปโอวาทและเตรียมความพร้อมเพื่อการทำงานและการศึกษาต่อ',
               'subPlanId'=>'12',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการพบอาจารย์ที่ปรึกษาเพื่อส่งเสริมคุณธรรมและจริยธรรมและรายงานผลการศึกษา',
               'subPlanId'=>'12',//yes
               'deptId'=>'6',
           ],

           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิตสาขาวิชาชีววิทยา',
               'subPlanId'=>'9',//yes
               'deptId'=>'6',
           ],

           [
               'projectName'=>'โครงการพัฒนาศักยภาพด้วยคุณลักษณะอันพึงประสงค์ของนักศึกษาปริญญาเอก',
               'subPlanId'=>'9',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการประชุมวิชาการสาขาชีววิทยาระดับปริญญาเอกภาคต้นและภาคบ่าย',
               'subPlanId'=>'9',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิตสาขาชีววิทยา',
               'subPlanId'=>'9',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพและคุณลักษณะอันพึงประสงค์ของนักศึกษาปริญญาโท',
               'subPlanId'=>'9',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'การผลิตบัณฑิตหลักสูตรวิทยาศาสตร์บัณฑิตสาขาวิชาชีววิทยา',
               'subPlanId'=>'9',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการประชุมวิชาการสาขาวิชาชีววิทยาระดับปริญญาตรีครั้งที่24',
               'subPlanId'=>'9',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทวิชาการ',
               'subPlanId'=>'10',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทสนับสนุน',
               'subPlanId'=>'10',//yes
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการสนับสนุนและส่งเสริมสหกิจศึกษาภายในประเทศ',
               'subPlanId'=>'11',
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการเผยแพร่ผลงานของนักศึกษา',
               'subPlanId'=>'11',
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการสนับสนุนครูผู้ช่วยสอนในการคุมปฏิบัติการระดับปริญญาตรี',
               'subPlanId'=>'11',
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการผลิตบัณฑิตระดับปริญญาโท',
               'subPlanId'=>'11',
               'deptId'=>'6',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการผลิตบัณฑิตระดับปริญญาเอก',
               'subPlanId'=>'11',
               'deptId'=>'6',
           ],
           
           //เคมี
           [
               'projectName'=>'โครงการค่ายเคมี',
               'subPlanId'=>'16',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการเคมี มข. แบ่งปันสุขสู่ชุมชน',
               'subPlanId'=>'16',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเคมีสำหรับครู',
               'subPlanId'=>'13',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเคมี',
               'subPlanId'=>'13',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเคมีอินทรีย์',
               'subPlanId'=>'13',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตร์บัณฑิต สาขาวิชาเคมี',
               'subPlanId'=>'13',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเคมี นานาชาติ',
               'subPlanId'=>'13',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเคมีวิทยาศาสตร์พอลิเมอร์',
               'subPlanId'=>'13',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทวิชาการ',
               'subPlanId'=>'14',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทสนับ',
               'subPlanId'=>'14',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการผู้ช่วยสอนและผู้ช่วยวิจัยสาขาวิชา',
               'subPlanId'=>'15',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการสนับสนุนทุนการศึกษาระดับบัณฑิตศึกษา',
               'subPlanId'=>'15',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการอุดหนุนการวิใจและการศึกษาสำหรับนักศึกษาระดับบัณฑิตศึกษาสาขาวิชาเคมี',
               'subPlanId'=>'15',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการเข้าร่วมนำเสนอผลงานทางวิชาการ',
               'subPlanId'=>'15',//yes
               'deptId'=>'3',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการทำวิจัยต่างประเทศ',
               'subPlanId'=>'15',//yes
               'deptId'=>'3',
           ],

           //คณิตศาสตร์

           [
               'projectName'=>'สนับสนุนดำเนินการจัดโครงการ',
               'subPlanId'=>'20',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการคณิตศาสตร์สู่ธรรม',
               'subPlanId'=>'20',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการบายศรีสู่ขวัญนักศึกษาสาขาวิชาคณิตศาสตร์',
               'subPlanId'=>'20',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการ bry nioe สาขาวิชาคณิตศาสตร์',
               'subPlanId'=>'20',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพด้านคอมพิวเตอร์และภาษาอังกฤษนักศึกษาระดับปริญญาตรีอ๋อ',
               'subPlanId'=>'20',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการศึกษาดูงานสำหรับนักศึกษา สาขาวิชาคณิตศาสตร์ปริญญาตรี',
               'subPlanId'=>'20',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการสัมมนาทำแผนและปฏิทินกิจกรรมนักศึกษาระดับปริญญาตรี',
               'subPlanId'=>'20',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการประชุมวิชาการนักศึกษาระดับปริญญาตรี',
               'subPlanId'=>'20',//yes
               'deptId'=>'2',
           ],
           
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตร์มหาบัณฑิต สาขาวิชาคณิตศาสตร์',
               'subPlanId'=>'17',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
               'subPlanId'=>'17',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตร์บัณฑิต สาขาวิชาคณิตศาสตร์',
               'subPlanId'=>'17',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
               'subPlanId'=>'17',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาคณิตศาสตร์',
               'subPlanId'=>'17',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
               'subPlanId'=>'17',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการศิษย์เก่าเล่าประสบการณ์',
               'subPlanId'=>'18',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการส่งเสริมบุคลากรเข้าประชุม/อบรม/สัมมนาทางวิชาการฯ',
               'subPlanId'=>'18',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการจัดสัมมนาแผนปฏิบัติการและทัศนศึกษาประจำปีสำหรับบุคลากรสาขาวิชาคณิตศาสตร์',
               'subPlanId'=>'18',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการดำเนินงานรายวิชาวิทยานิพนธ์',
               'subPlanId'=>'19',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการอุดหนุนการวิจัยและการศึกษาสำหรับนักศึกษาระดับบัณฑิตศึกษาสาขาวิชาคณิตศาสตร์',
               'subPlanId'=>'19',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการพัฒนาประสารกิจนักศึกษาระดับบัณฑิตศึกษา',
               'subPlanId'=>'19',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการสนับสนุนผู้ช่วยสอนและผู้ช่วยวิจัยสาขาวิชาคณิตศาสตร์',
               'subPlanId'=>'19',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการสนับสนุนและส่งเสริมสหกิจศึกษาภายในประเทศ',
               'subPlanId'=>'19',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการเชิญผู้เชี่ยวชาญภายในประเทศ',
               'subPlanId'=>'19',//yes
               'deptId'=>'2',
           ],
           
           [
               'projectName'=>'โครงการเชิญผู้เชี่ยวชาญต่างประเทศ',
               'subPlanId'=>'19',//yes
               'deptId'=>'2',
           ],
           [
               'projectName'=>'โครงการส่งเสริมความเข้มแข็งการวิจัย',
               'subPlanId'=>'19',//yes
               'deptId'=>'2',
           ],
           


           //ฟิสิกส์
           [
               'projectName'=>'โครงการศึกษาดูงานนอกสถานที่ของนักศึกษา',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           [
               'projectName'=>'โครงการพัฒนาและส่งเสริมทักษะภาษาอังกฤษ',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการสนับสนุนนักศึกษาเข้าร่วมประชุมวิชาการ',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการปรับพื้นฐานการเรียนนักศึกษา',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการสัมมนาวิชาการสาขาฟิสิกส์',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการอาจารย์ที่ปรึกษาพบนักศึกษา',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           [
               'projectName'=>'โครงการพัฒนาและส่งเสริมคุณธรรมจริยธรรม',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการอบรมทักษะด้านดาราศาสตร์ภาคสังเกตการณ์ ',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการดาราศาสตร์ฤดูหนาวแก่โรงเรียนในภาคตะวันออกเฉียงเหนือ',
               'subPlanId'=>'23',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาฟิสิกส์',
               'subPlanId'=>'21',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวัสดุศาสตร์และนาโนเทคโนโลยี ',
               'subPlanId'=>'21',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาฟิสิกส์',
               'subPlanId'=>'21',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาวัสดุศาสตร์และนาโนเทคโนโลยี',
               'subPlanId'=>'21',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์',
               'subPlanId'=>'21',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรบัณฑิต สาขาวัสดุศาสตร์และนาโนเทคโนโลยี',
               'subPlanId'=>'21',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการสัมมนาจัดทำแผนปฏิบัติการ',
               'subPlanId'=>'22',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการส่งเสริมความผาสุกของบุคลากรสาขาวิชาฟิสิกส์',
               'subPlanId'=>'22',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการสนับสนุนการดำเนินงานรายวิชาวิทยานิพนธ์',
               'subPlanId'=>'24',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการสนับสนุนการดำเนินงานรายวิชาวิทยานิพนธ์',
               'subPlanId'=>'24',//yes
               'deptId'=>'8',
           ],
           
           [
               'projectName'=>'โครงการสนับสนุนและส่งเสริมสหกิจศึกษา',
               'subPlanId'=>'24',//yes
               'deptId'=>'8',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการทำโปรเจค',
               'subPlanId'=>'24',//yes
               'deptId'=>'8',
           ],



           //สถิคิ
           [
               'projectName'=>'โครงการประชุมวิชาการโครงงานทางสถิติและสารสนเทศสถิติสำรวจนักศึกษาชั้นปีที่4 ภาคต้น',
               'subPlanId'=>'28',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการสัมมนาวิชาการสำหรับนักศึกษาชั้นปีที่4สาขาวิชาสถิติ',
               'subPlanId'=>'28',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการศึกษาดูงามนอกสถานที่ของนักศึกษาสาขาวิชาสถิติ',
               'subPlanId'=>'28',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการปิดกล่องชอร์กสาขาวิชาสถิติ',
               'subPlanId'=>'28',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการประชุมวิชาการโครงงานทางสถิติและสารสนเทศสถิติสำหรับนักศึกษาชั้นปีที่4 ภาคปลาย',
               'subPlanId'=>'28',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการค่ายเตรียมความพร้อมก่อนเรียนสำหรับนักศึกษาใหม่สาขาวิชาสถิติ',
               'subPlanId'=>'28',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการเสริมทักษะด้านวิชาการสำหรับนักศึกษาชั้นปีที่1 สาขาวิชาสถิติ',
               'subPlanId'=>'28',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาสถิติประยุกต์',
               'subPlanId'=>'25',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติและวิทยาการข้อมูล',
               'subPlanId'=>'25',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการเข้าประชุมอบรมสัมมนาและนำเสนอผลงานวิชาการของบุคลากรประเภทวิชาการและประเภทสนับสนุน',
               'subPlanId'=>'26',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการอุดหนุนการวิจัยและการศึกษาสำหรับนักศึกษาระดับบัณฑิตศึกษาสาขาวิชาสถิติ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการสนับสนุนทุนการศึกษาระดับปริญญาตรีสาขาวิชาสถิติ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการดำเนินงานวิจัยสำหรับอาจารย์สาขาวิชาสถิติ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการดำเนินงานบริการวิชาการที่ปรึกษา/วิจัยสาขาวิชาสถิติ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการเชิญผู้เชี่ยวชาญด้านสถิติและวิทยาการข้อมูลภายในประเทศ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการเชิญผู้เชี่ยวชาญด้านสถิติและวิทยาการข้อมูลต่างประเทศ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการอุดหนุนนักศึกษาทุน (พสวท) สาขาวิชาสถิติ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการอุดหนุนการเข้าร่วมและการนำเสนอผลงานวิจัยสำหรับนักศึกษาระดับปริญญาตรีสาขาวิชาสถิติ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],
           [
               'projectName'=>'โครงการสนับสนุนทุนและส่งเสริมสหกิจศึกษาสาขาวิชาสถิติ',
               'subPlanId'=>'27',//yes
               'deptId'=>'10',
           ],

           

           //จุลชีววิทยา

           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาจุลชีววิทยา',
               'subPlanId'=>'29',//yes
               'deptId'=>'4',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาจุลชีววิทยา',
               'subPlanId'=>'29',//yes
               'deptId'=>'4',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาจุลชีววิทยา',
               'subPlanId'=>'29',//yes
               'deptId'=>'4',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทวิชาการ',
               'subPlanId'=>'30',//yes
               'deptId'=>'4',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทสนับสนุน',
               'subPlanId'=>'30',//yes
               'deptId'=>'4',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการทำวิจัยนักศึกษาบัณฑิตศึกษา',
               'subPlanId'=>'31',
               'deptId'=>'4',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาจุลชีววิทยา',
               'subPlanId'=>'31',
               'deptId'=>'4',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาจุลชีววิทยา',
               'subPlanId'=>'31',
               'deptId'=>'4',
           ],


           //นิติวิทยาศาสตร์

           [
               'projectName'=>'โครงการผลิตบัณฑิตระดับปริญญาโท สาขาวิชานิติวิทยาศาสตร์',
               'subPlanId'=>'36',//yes
               'deptId'=>'11',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตระดับปริญญาโท สาขาวิชานิติวิทยาศาสตร์โครงการพิเศษ',
               'subPlanId'=>'37',//yes
               'deptId'=>'11',
           ],
       




           //การให้บริการ
           [
               'projectName'=>'โครงการสัปดาห์วันวิทยาศาสตร์',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการโอลิมปิกวิชาการ',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการจรวดขวดน้ำและเครื่องบินกระดาษพับ',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการมหาวิทยาลัยเด็ก',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการวิทยาศาสตร์สัญจร',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเสริมความรู้และทักษะวิทยาศาสตร์และเทคโนโลยี (ระดับคณะ)',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการบริหารวิชาการทางด้านสถิติสาขาวิชาสถิติ',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการค่ายเยาวชนชีววิทยาครั้งที่26',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           
           [
               'projectName'=>'โครงการรักษ์ป่า รักษ์นก ในมหาวิทยาลัยขอนแก่น',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],

           [
               'projectName'=>'โครงการบริการวิเคราะห์ทางจุลชีววิทยา',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเตรียมความพร้อมเคมีโอลิมปิก',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการฟิสิกส์สัปประยุทธ์',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการฟิสิกส์สัญจร',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการจัดประชุมวิชาการ ANSCSE25 ',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการอบรมฟิสิกส์อนุภาคภูมิภาค',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการโอลิมปิกวิชาการค่าย3',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการคณิตศาสตร์เพื่อชุมชน',
               'subPlanId'=>'40',//yes
               'deptId'=>'1',
           ],



           //วัฒนธรรม


           [
               'projectName'=>'โครงการทำนุบำรุงศาสนาและวัฒนธรรม',
               'subPlanId'=>'41',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการวันสงกรานต์',
               'subPlanId'=>'41',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการวันสถาปนาคณะวิทยาศาสตร์',
               'subPlanId'=>'41',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการลอยกระทง',
               'subPlanId'=>'41',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการมุทิตาจิตผู้เกษียณอายุราชการ',
               'subPlanId'=>'41',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการทำบุญส่งท้ายปีเก่าต้อนรับปีใหม่',
               'subPlanId'=>'41',//yes
               'deptId'=>'1',
           ],


           //องค์ความรู้

           [
               'projectName'=>'โครงการสนับสนุนการวิจัยจุลินทรีย์',
               'subPlanId'=>'42',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการประชุมวิชาการศึกษาศาสตร์แห่งประเทศไทยครั้งที่14',
               'subPlanId'=>'42',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการ BCG ชีววิทยา 2565',
               'subPlanId'=>'42',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเสริมสร้างความเข้มแข็งด้านงานวิจัย',
               'subPlanId'=>'43',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการส่งเสริมการวิจัยสถาบัน',
               'subPlanId'=>'43',//yes
               'deptId'=>'1',
           ],


           //ชีวเคมี


           [
               'projectName'=>'โครงการหลักสูตรประกาศนียบัตร สาขาวิชาชีวเคมี',
               'subPlanId'=>'44',//yes
               'deptId'=>'5',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาชีวเคมี',
               'subPlanId'=>'44',//yes
               'deptId'=>'5',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิชาวิทยาศาสตรมหาบัณฑิต สาขาวิชาชีวเคมี',
               'subPlanId'=>'44',//yes
               'deptId'=>'5',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาชีวเคมี',
               'subPlanId'=>'44',//yes
               'deptId'=>'5',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทวิชาการ',
               'subPlanId'=>'45',//yes
               'deptId'=>'5',
           ],

           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทสนับสนุน',
               'subPlanId'=>'45',//yes
               'deptId'=>'5',
           ],

           [
               'projectName'=>'โครงการสนับสนุนทุนการศึกษาระดับบัณฑิตศึกษา',
               'subPlanId'=>'46',//yes
               'deptId'=>'5',
           ],

           [
               'projectName'=>'โครงการสนับสนุนผู้ช่วยสอนและผู้ช่วยวิจัยสาขาชีวเคมี',
               'subPlanId'=>'46',//yes
               'deptId'=>'5',
           ],



           //สิ่งแวดล้อม


           [
               'projectName'=>'โครงการปัจฉิมนิเทศนักศึกษาสาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม',
               'subPlanId'=>'35',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการการปรับปรุงภูมิทัศน์และพื้นที่สีเขียวปลูกต้นไม้สายสัมพันธ์',
               'subPlanId'=>'35',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการการสนับสนุนเมื่อกิจกรรมการดูนกและศึกษาธรรมชาติ',
               'subPlanId'=>'35',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการการพัฒนาทักษะการเรียนรู้ด้านภาษาอังกฤษ',
               'subPlanId'=>'35',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการการอบรมผู้ควบคุมระบบมลพิษสิ่งแวดล้อม',
               'subPlanId'=>'35',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการการแนะแนวการเรียนการสอนให้สอดคล้องกับความต้องการและความถนัดของนักศึกษา (ปี2)',
               'subPlanId'=>'35',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม',
               'subPlanId'=>'32',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม',
               'subPlanId'=>'32',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการผลิตบัณฑิตหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม',
               'subPlanId'=>'32',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทวิชาการ',
               'subPlanId'=>'33',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการพัฒนาศักยภาพบุคลากรประเภทสนับสนุน',
               'subPlanId'=>'33',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการเชิญผู้เชี่ยวชาญภายในประเทศ',
               'subPlanId'=>'34',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการประชุมวิชาการของนักศึกษาระดับปริญญาตรี สาขาวิทยาศาสตร์สิ่งแวดล้อม',
               'subPlanId'=>'34',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการอุดหนุนการวิจัยและการศึกษาสำหรับนักศึกษาระดับบัณฑิตศึกษา สาขาวิชาวิทยาศาสตร์',
               'subPlanId'=>'34',//yes
               'deptId'=>'7',
           ],
           [
               'projectName'=>'โครงการผู้ช่วยสอนและผู้ช่วยวิจัยสาขาวิทยาศาสตร์สิ่งแวดล้อมโดยใช้กองทุนส่งเสริมการผลิตบัณฑิตและพัฒนาวิชาการคณะวิทยาศาสตร์',
               'subPlanId'=>'34',//yes
               'deptId'=>'7',
           ],


           //บริหารการจัดการศึกษา

           [
               'projectName'=>'โครงการพัฒนาศักยภาพนักศึกษา',
               'subPlanId'=>'1',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสร้างทักษะของนักศึกษาด้านความคิดเชิงสร้างสรรค์',
               'subPlanId'=>'1',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสร้างนพัฒนาจิตใจ นิเวศและสังคม',
               'subPlanId'=>'1',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนาและส่งเสริมผู้มีความรู้ความสามารถทางวิทยาศาสตร์ (พสวท)',
               'subPlanId'=>'2',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนากำลังคนด้านวิทยาศาสตร์  (ทุนเรียนดีวิทยาศาสตร์แห่งประเทศไทย)',
               'subPlanId'=>'2',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการรับบุคคลผู้มีศักยภาพเข้าศึกษา',
               'subPlanId'=>'2',//yes
               'deptId'=>'1',
           ],
           
           [
               'projectName'=>'โครงการเสริมความเข้มแข็งการผลิตบัณฑิตโดยผู้ช่วยสอนและผู้ช่วยวิจัย ',
               'subPlanId'=>'2',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการ TGIST',
               'subPlanId'=>'2',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการtalent mobility',
               'subPlanId'=>'2',//yes
               'deptId'=>'1',
           ],

           [
               'projectName'=>'โครงการสนับสนุนการจัดการเรียนการสอนรายวิชาพื้นฐานและ pre สหกิจศึกษา',
               'subPlanId'=>'2',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเสริมสร้างและสนับสนุนการบริหารเชิงยุทธศาสตร์เพื่อเพิ่มขีดความสามารถการแข่งขัน',
               'subPlanId'=>'3',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการคณะสะอาด',
               'subPlanId'=>'4',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนาระบบกายภาพและสาธารณูปโภค',
               'subPlanId'=>'4',//yes
               'deptId'=>'1',
           ],
           
           [
               'projectName'=>'โครงการประหยัดพลังงาน',
               'subPlanId'=>'4',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการยกระดับความปลอดภัยห้องปฏิบัติการวิจัย',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>' โครงการสนับสนุนโครงการ วมว.',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการบำรุงรักษาเครื่องมือกลาง',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนาองค์กรและระบบบริหารเพื่อสนับสนุนภารกิจเชิงยุทธศาสตร์',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนาระบบเทคโนโลยีสารสนเทศเพื่อสนับสนุนงานเชิงยุทธศาสตร์',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการคณะปลอดภัย',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเสริมสร้างความเข้มแข็งระบบประเมินคุณภาพและประกันคุณภาพ',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเสริมความเข้มแข็งการขับเคลื่อนยุทธศาสตร์คณะวิทยาศาสตร์',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการจัดการความรู้และแลกเปลี่ยนเรียนรู้',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],[
               'projectName'=>'โครงการห้องเรียนพร้อมใช้',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนดำเนินโครงงาน',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนพัฒนาศักยภาพทรัพยากรบุคล',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสัมนาประจำปีเสริมความเข้มแข็งการขับเคลื่อนยุทธศาสตร์คณะวิทยาศาสตร์ของบุคลากรประเภทสนับสนุน',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนาและเสริมสร้างความเข้มแข็งทางการสื่อสารองค์กร',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการศิษย์เก่าสัมพันธ์(ระดับคณะ)',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'พัฒนาเครือข่ายบุคลากรผ่านกิจกรรมกลุ่ม',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเพิ่มประสิทธิภาพการใช้งานยานพาหนะ',
               'subPlanId'=>'5',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนทุนการศึกษาผ่านกองทุน50ปีคณะวิทยาศาสตร์',
               'subPlanId'=>'6',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการกิจกรรมนักศึกษาและกิจการพิเศษผ่านกองทุน50ปีคณะวิทยาศาสตร์',
               'subPlanId'=>'6',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนาห้องปฏิบัติการสูงมาตรฐานคุณภาพiso',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการทุนสนับสนุนการศึกษาสำหรับบุคลากรจากประเทศในภูมิภาคอาเซียนและอนุภูมิภาคลุ่มน้ำโขง',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนทุนอุดหนุนการศึกษาคณะวิทยาศาสตร์',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเสริมสร้างและสนับสนุนการบริหารเชิงยุทธศาสตร์ผ่านกองทุนส่งเสริมการผลิตบัณฑิตและพัฒนาวิชาการคณะวิทยาศาสตร์',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการเปิดโลกทัศน์ของนักศึกษาสู่ความเป็นสากล',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนาหลักสูตรนานาชาติระดับปริญญาตรี',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการส่งเสริมค่าครองชีพ นักศึกษา',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการศึกษาต่อของบุคลากร',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการดำเนินงานสหกิจศึกษาภายในประเทศ',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการแลกเปลี่ยนนักศึกษากับต่างประเทศ',
               'subPlanId'=>'7',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการส่งเสริมการวิจัยสถาบันเพื่อพัฒนาองค์กร',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการพัฒนานักวิจัยใหม่',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนการดำเนินงานสหกิจศึกษาต่างประเทศ',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสร้างเครือข่ายความร่วมมือทางการศึกษาและการวิจัยภายในประเทศและต่างประเทศ',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการส่งเสริมความเข้มแข็งของนักศึกษาระดับบัณฑิตศึกษา',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการสนับสนุนทุนระดับบัณฑิตศึกษาแบบร่วมทุน',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการอุดหนุนการดำเนินงานวารสารวิทยาศาสตร์ มข.',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการปฐมนิเทศนักศึกษาระดับบัณฑิตศึกษา',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการประชุมวิชาการของนักศึกษาระดับปริญญาตรี',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการประชุมวิชาการของนักศึกษาระดับบัณฑิตศึกษา',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           [
               'projectName'=>'โครงการผู้ช่วยสอนและผู้ช่วยวิจัยโดยใช้เงินอุดหนุนกองทุนเสริมการผลิตบัณฑิตและพัฒนาวิชาการคณะวิทยาศาสตร์',
               'subPlanId'=>'47',//yes
               'deptId'=>'1',
           ],
           

       ];

        foreach ($Project as $key => $value) {
            Project::create($value);
        }
        
    }
}