<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>-:- ระบบจัดการข้อมูลการจัดซื้อ จัดจ้างพัสดุ SC KKU -:-</title>
    
    <link rel="stylesheet" href="style/style.css">  

    <!-- Standard -->
    <link rel="shortcut icon" href="image/logo/logo_only.png">

    <link rel="stylesheet" href="bootstrap/css/bootstrap.min.css">
    <link rel="stylesheet" href="bootstrap/css/bootstrap-grid.min.css">
    <link rel="stylesheet" href="bootstrap/css/bootstrap-reboot.min.css">

    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Prompt:wght@300&display=swap" rel="stylesheet">
    

</head>

<body onload="StartClock24()">
    <!--NavBarUP-->
    <section class="navbarUp">
        <div class="row">
            <div class="col-md-12 bgnavUp">
                <div class="container">
                    <nav>

                        <img src="/image/logo/logo.png" class="logo" alt="logo">
        
                        <ul class="menuNavBarUp">
                            <li class="listItem">
                                <a class="loginBtn" href="login">เข้าสู่ระบบ</a>
                            </li>
                        </ul>
        
                    </nav>
            
                </div> 
                
            </div>        
        </div>
    </section>

    <!--NavBarTwo-->
    <section class="navbarTwo">
        <div class="row">
            <div class="col-md-12 bgnavTwo">
                <div class="container">
                    <nav>
                        <ul class="menuNavBarTwo">
                            <li class="mainMenuLists">
                                <a class="mainMenuBtn active" href="index">หน้าหลัก</a>
                                <a class="mainMenuBtn" href="about">เกี่ยวกับเรา</a>
                                <a class="mainMenuBtn" href="stafff">บุคลากร</a>
                                <a class="mainMenuBtn" href="law">กฏหมายและระเบียบ</a>
                                <a class="mainMenuBtn" href="buynhire">คู่มือการปฏิบัติงาน</a>
                                <a class="mainMenuBtn" href="download">ประกาศ/คำสั่ง</a>
                            </li>
                        </ul>

                    </nav>
            
                </div> 
                
            </div>        
        </div>
    </section>
 
    <!--Line-->
    <div class="row">
        <div class="col-md-12 bgnavline"></div>        
    </div>


    
    <div class="container bg">
        <div class="row">
            <div class="col-md-2"></div>
            <div class="col-md-8">
                <center><h3 style="margin-top: 20px; margin-bottom: 20px;">เกี่ยวกับเรา</h3></center>

                <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คณะวิทยาศาสตร์ ได้รับการจัดตั้งขึ้น เมื่อปีพุทธศักราช 2507 พร้อมกับมหาวิทยาลัยขอนแก่น และได้มีพระราชกฤษฎีกา จัดแบ่งคณะในมหาวิทยาลัยขอนแก่น เมื่อวันที่ 28 กุมภาพันธ์ พุทธศักราช 2509 โดยใช้ชื่อว่า “คณะวิทยาศาสตร์-อักษรศาสตร์” ทำหน้าที่ให้บริการสอนวิชาพื้นฐานด้านวิทยาศาสตร์และภาษาอังกฤษ แก่นักศึกษาคณะเกษตรศาสตร์และคณะวิศวกรรมศาสตร์ รวมทั้งนักศึกษาคณะศึกษาศาสตร์และคณะพยาบาลศาสตร์ ในปีพุทธศักราช 2516 เริ่มมีการรับนักศึกษาสาขาวิทยาศาสตร์ของคณะวิทยาศาสตร์-อักษรศาสตร์ รุ่นแรก 4 สาขาวิชา คือ สาขาวิชาคณิตศาสตร์ ฟิสิกส์ เคมี และชีววิทยา ต่อมาในปีพุทธศักราช 2518 มีการรับนักศึกษาสาขาบรรณารักษ์ศาสตร์ ทำให้มีภารกิจเพิ่มขึ้นในด้านการผลิตบัณฑิตทางวิทยาศาสตร์และทางอักษรศาสตร์ ดังนั้น เพื่อให้การจัดการเรียนการสอนมีความเป็นเอกภาพ ในปีพุทธศักราช 2521 จึงได้มีการแยกออกเป็น 2 คณะ คือ “คณะวิทยาศาสตร์” และ “คณะมนุษยศาสตร์และสังคมศาสตร์” <br><br>


                    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คณะวิทยาศาสตร์เมื่อแรกก่อตั้งได้แบ่งส่วนราชการเป็น 5 ส่วน คือ สำนักงานคณบดี ภาควิชาคณิตศาสตร์ ภาควิชาเคมี ภาควิชาชีววิทยา และภาควิชาฟิสิกส์ ปัจจุบันประกอบด้วย 10 ส่วน คือ สำนักงานคณบดี ภาควิชาคณิตศาสตร์ ภาควิชาเคมี ภาควิชาชีววิทยา ภาควิชาฟิสิกส์ ภาควิชาจุลชีววิทยา ภาควิชาชีวเคมี ภาควิชาวิทยาศาสตร์สิ่งแวดล้อม ภาควิชาสถิติ และภาควิชาวิทยาการคอมพิวเตอร์ มีหลักสูตรรวม 47 หลักสูตร ประกอบด้วยหลักสูตรระดับปริญญาตรี 14 หลักสูตร ระดับปริญญาโท 19 หลักสูตร และระดับปริญญาเอก 14 หลักสูตร<br><br>
                    
                    
                    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คณะวิทยาศาสตร์ มีการกำหนดวิสัยทัศน์เพื่อตั้งเป้าหมายในการดำเนินการของคณะวิทยาศาสตร์ โดยเป้าหมายแห่งคุณภาพคือบัณฑิตของคณะวิทยาศาสตร์ กอปรด้วยวิทยา จริยา ปัญญา มีคุณลักษณะของบัณฑิตที่พึงประสงค์ เป็นผู้มีจิตสาธารณะ มีความเป็นพลเมืองที่ดีของสังคม มีบทบาทและภาวะผู้นำในภาคส่วนต่างๆ ผลงานวิจัยและนวัตกรรมของคณะวิทยาศาสตร์ได้มีส่วนนำไปใช้ในการสร้างเสริมคุณค่าและพัฒนาภาคตะวันออกเฉียงเหนือและประเทศ มีการถ่ายทอดความรู้ เทคโนโลยีและนวัตกรรมสู่สังคม นักศึกษา ศิษย์เก่าและบุคลากรได้รับการยกย่องในเวทีต่างๆ ทั้งในระดับชาติและนานาชาติ นอกจากนี้คณะวิทยาศาสตร์ยังมีเป้าหมายเป็นองค์กรแห่งการเรียนรู้ที่มีขีดความสามารถสูง บุคลากรมีคุณภาพชีวิตในการทำงานบนพื้นฐานของความภักดีและผูกพันกับองค์กร อีกทั้งมีคุณภาพมาตรฐานโดยผ่านการประเมินคุณภาพจากสำนักงานรับรองมาตรฐานและประเมินคุณภาพการศึกษา (สมศ.) ในระดับดีมากทุกรอบการประเมิน และได้รับการจัดอันดับการศึกษาจากองค์กรต่างประเทศ<br><br>
                    
                    
                    ผลงานหรือรางวัลแห่งความภาคภูมิใจของคณะวิทยาศาสตร์ <br>
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- QS University Rankings : Asia 2015 (ลำดับที่ 171-180)
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- ปี พ.ศ. 2552 มีผลการประเมินคุณภาพผลงานวิจัยเชิงวิชาการด้านวิทยาศาสตร์และเทคโนโลยีของสถาบันอุดมศึกษาในประเทศไทยอยู่ในระดับดีมาก 3 สาขาวิชา ได้แก่ สาขาวิชาเคมี สาขาวิชาชีววิทยา สาขาวิชาคณิตศาสตร์ (ประเมินโดย สกว.)
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- รางวัลคณะวิชาที่มีผลงานดีเยี่ยม สาขาวิชาวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยขอนแก่น ประจำปี 2557
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- รางวัลรองชนะเลิศอันดับ 2 คณะวิชาที่มีผลงานด้านการวิจัยระดับดีเยี่ยม สาขาวิชาวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยขอนแก่น ประจำปี 2556
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- รางวัลชนะเลิศคณะวิชาที่มีผลงานด้านการวิจัยระดับดีเยี่ยม สาขาวิชาวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยขอนแก่น ประจำปี 2555
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- รางวัลชนะเลิศคณะวิชาที่มีผลงานด้านการวิจัยระดับดีเยี่ยม สาขาวิชาวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยขอนแก่น ประจำปี 2554
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- รางวัลชนะเลิศคณะวิชาที่มีผลงานด้านการวิจัยระดับดีเยี่ยม สาขาวิชาวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยขอนแก่น ประจำปี 2553
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- รางวัลรองชนะเลิศอันดับ 1 คณะวิชาที่มีผลงานด้านการวิจัยระดับดีเยี่ยม สาขาวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยขอนแก่น ประจำปี 2552
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- รางวัลรองชนะเลิศอันดับ 2 คณะวิชาที่มีผลงานด้านการวิจัยระดับดีเยี่ยม สาขาวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยขอนแก่น ประจำปี 2550-2551
                    
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- ผลงานตีพิมพ์ในวารสารวิชาการระดับนานาชาติของคณะวิทยาศาสตร์ (ปี 2009 – 2014) ปี 2014 จำนวน 230 บทความ ปี 2013 จำนวน 204 บทความ ปี 2012 จำนวน 190 บทความ ปี 2011 จำนวน 155 บทความ ปี 2010 จำนวน 146 บทความ ปี 2009 จำนวน 130 บทความ
                    
                    <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;นอกจากนี้ คณะวิทยาศาสตร์ยังได้ให้ความสำคัญด้านการบริการวิชาการแก่ชุมชน ซึ่งเป็นกิจกรรมที่สำคัญต่อการพัฒนาชุมชนภาคตะวันออกเฉียงเหนือและพัฒนาประเทศ โดยดำเนินการในรูปแบบต่างๆ เช่น การจัดกิจกรรมสัปดาห์วิทยาศาสตร์แห่งชาติ ซึ่งจัดในเดือนสิงหาคมของทุกปี โครงการโอลิมปิกวิชาการและดาราศาสตร์โอลิมปิก ค่ายวิทยาศาสตร์สัญจร (Science Tour) โครงการเสริมความรู้และทักษะทางวิทยาศาสตร์และเทคโนโลยีสำหรับนักเรียนในระดับมัธยมศึกษาตอนปลาย โครงการดาราศาสตร์ฤดูหนาวแก่โรงเรียนในภาคตะวันออกเฉียงเหนือ ณ เขื่อนจุฬาภรณ์ จังหวัดชัยภูมิ ค่ายวิชาการในสาขาวิชาต่างๆ อาทิ โครงการค่ายเคมี โครงการค่ายเยาวชนชีววิทยา โครงการฟิสิกส์สัญจร โครงการค่ายฝึกอบรมพัฒนาผู้นำเยาวชนอีสาน 20 จังหวัด โครงการค่ายดูนกและศึกษาธรรมชาติ โครงการส่งเสริมและสนับสนุนค่ายคอมพิวเตอร์ และวารสารวิทยาศาสตร์ มข. เป็นต้น</p>


                    <div>
                        <a style="float: right; text-decoration: none;" href="https://sc.kku.ac.th/" target="blank">อ่านต่อได้ที่ https://sc.kku.ac.th/</a>
                    </div>
            </div>



        

            <div class="col-md-2"></div>
        </div>

    </div>

    <!--Line-->
    <div class="row">
        <div class="col-md-12 bgnavline"></div>        
    </div>

    <section class="footer">
        <div class="row">
            <div class="col-md-12 footerbg">
                <div class="container margintopTwentyPx">
                    <div class="row marginbottomTenPx">
                        <div class="col-md-2">
                            
                        </div>

                        <div class="col-md-8 footerContent">
                            <p>กลุ่มภาระงานด้านพัสดุ คณะวิทยาศาสตร์ มหาวิทยาลัยขอนแก่น</p>
                            <p>Supplies Unit, Faculty of Science, Khon Kaen University</p>
                            <p>123 ถ.มิตรภาพ ต.ในเมือง อ.เมือง จ.ขอนแก่น 40002</p>
                        </div>

                        <div class="col-md-2">
                            
                        </div>

                    </div>
                </div> 
                
            </div>        
        </div>
    </section>
    
    
</body>
</html>